[
{
  "section": "5",
  "title": "Terms and Definitions",
  "terms_and_definitions": [
     {
      "term": "accuracy",
      "definition": "The closeness of an estimated value (measured or computed, for example) to a standard or accepted (true) value of a particular quantity together with an explicit reference to the specific standard or accepted value. Not to be confused with precision.",
      "subterms": [
        {
          "term": "absolute accuracy",
          "definition": "A measure that accounts for all systematic and random positional errors in a data set when the data set is referenced to a known and explicitly-specified datum."
        },
        {
          "term": "product accuracy",
          "definition": "Actual achieved accuracy (horizontal, vertical, and three-dimensional positional accuracy) computed by statistical means for a geospatial dataset."
        },
        {
          "term": "target accuracy",
          "definition": "Intended accuracy (horizontal, vertical, and three-dimensional positional accuracy) of the final product."
        }
      ]
    },
    {
      "term": "accuracy class (horizontal, vertical, and three-dimensional positional accuracy classes)",
      "definition": "The quantification of a quality threshold in a project's scope of work. Accuracy class is expressed in this and previous editions of the standards as a function of the mapping product's RMSE."
    },
    {
      "term": "bias",
      "definition": "A systematic error inherent in measurements, due to some deficiency in the measurement process or subsequent processing. Biases can be detected, quantified, and removed if a correct procedure is followed. Biases should be removed from a data set before accuracy assessment is performed."
    },
    {
      "term": "blunder",
      "definition": "A mistake resulting from carelessness or negligence. Not to be confused with error; refer to positional error for more information."
    },
    {
      "term": "boresighting",
      "definition": "The process of determining the angular rotations between the body of the sensor like Lidar or camera and the body of the Inertial Measurement Unit (IMU)."
    },
    {
      "term": "confidence level",
      "definition": "The percentage of points within a data set that are estimated to meet the stated accuracy; e.g., accuracy reported at the 95% confidence level means that 95% of the positions in the data set will have an error with respect to true ground position that are less than the reported accuracy value."
    }
  ]
},

{
  "section": "terms_and_definitions",
  "terms": [
    {
      "term": "data internal precision",
      "definition": "A measure of the variation of positional accuracy from point to point within a data set when evaluated across a leveled plane. In these Standards, it relates to the vertical quality of elevation data."
    },
    {
      "term": "ground sample distance (GSD)",
      "definition": "The linear dimension of a sample pixel’s footprint on the ground. In raw imagery, pixel size is not uniform and varies based on sensor orientation and terrain. The term 'nominal GSD' refers to the average or approximate size of pixels in raw imagery. In orthorectified imagery, the GSD for all pixels is uniform and constant regardless of the terrain variation."
    },
    {
      "term": "horizontal accuracy",
      "definition": "The horizontal (radial) component of positional error in a data set with respect to a horizontal datum at a specified confidence level. The horizontal accuracy is computed from the horizontal positional error along the X and Y axes using the following formula.",
      "equation": "RMSH_H = √(RMSE_x^2 + RMSE_y^2)"
    },
    {
      "term": "inertial measurement unit (IMU)",
      "definition": "A combination of multiple accelerometers and gyroscopes used to measure absolute spatial displacement. In geospatial sensors technologies, the IMU is mainly used to measure the sensor orientation angles roll, pitch, and yaw/heading."
    },
    {
      "term": "mean error",
      "definition": "The average positional error in a set of values for one dimension (X, Y, or Z), obtained by adding all errors in a single dimension together and then dividing by the total number of errors for that dimension."
    },
    {
      "term": "median error",
      "definition": "The middle error value when errors are ranked or arranged in order of magnitude. For odd numbers of checkpoints, say 2k + 1, the median is the (k + 1)th error value. For even numbers, say 2k, the median is (k + (k + 1)) / 2, the average of the two values closest to the middle."
    },
    {
      "term": "network accuracy",
      "definition": "The uncertainty in the coordinates of mapped points with respect to the geodetic datum at the specified confidence level. In other words, network accuracy measures how well coordinates approach an ideal, error-free datum."
    },
    {
      "term": "non-vegetated vertical accuracy (NVA)",
      "definition": "The vertical accuracy of the elevation surface in open terrain or bare earth."
    },
    {
      "term": "percentile",
      "definition": "A measure used in statistics which indicates the value below which a given percentage of observations in a group of observations fall. For accuracy testing, percentile calculations are based on the absolute values of the errors since it is the magnitude of the errors and not the sign that is of concern."
    },
    {
      "term": "planimetric data",
      "definition": "The data in a planimetric map that displays features on the ground expressed in two-dimensional coordinates."
    }
  ]
},

{
  "section": "terms_and_definitions",
  "terms": [
    {
      "term": "positional error",
      "definition": "The difference between data set coordinate values and coordinate values from an independent source of higher accuracy for identical points. Positional error is measured along each of the three coordinate axes: X, Y, and Z. True values of spatial coordinates can never be known; therefore, the values referred to as 'errors' are more formally known as 'residuals' or 'residual errors'."
    },
    {
      "term": "precision",
      "definition": "The closeness with which measurements agree with each other. Precision does not show the systematic error or bias if it is present in the measurements."
    },
    {
      "term": "resolution",
      "definition": "The level of detail in an image or data, or the smallest detail a sensor can detect. In imagery, 'higher resolution' means more image detail. It is measured by how close alternating black and white lines can be and still be visibly resolved, usually in lines-per-millimeter."
    },
    {
      "term": "root-mean-square error (RMSE)",
      "definition": "The square root of the average of the set of squared differences between data set coordinate values and coordinate values from an independent source of higher accuracy for identical points."
    },
    {
      "term": "skew",
      "definition": "A measure of the asymmetry of a probability distribution. Skewness values can be positive, zero, or negative. A value near zero does not always imply symmetry, but a symmetrical distribution will always have a skew near zero."
    },
    {
      "term": "standard deviation",
      "definition": "A measure of spread or dispersion of a sample of errors around the sample mean error. It measures precision, not accuracy, and does not account for uncorrected systematic errors."
    },
    {
      "term": "systematic error",
      "definition": "An error whose algebraic sign and magnitude bear a fixed relation to some condition or set of conditions. Systematic errors follow a fixed pattern and are introduced by data collection procedures, processing, or the datum used."
    },
    {
      "term": "three-dimensional positional accuracy",
      "definition": "The accuracy of the three-dimensional position (X, Y, and Z) of features with respect to horizontal and vertical datums.",
      "equation": "RMSE_3D = √(RMSE_x² + RMSE_y² + RMSE_z²)"
    },
    {
      "term": "uncertainty (of measurement)",
      "definition": "A parameter that characterizes the dispersion of measured values, or the range in which the 'true' value most likely lies. Also considered an estimate of the limits of the error in a measurement. Standard uncertainty refers to uncertainty expressed as a standard deviation."
    },
    {
      "term": "vegetated vertical accuracy (VVA)",
      "definition": "The accuracy of the elevation surface in areas where terrain is covered by vegetation."
    }
  ]
},

{
  "term": "vertical accuracy",
  "definition": "The vertical component of the positional accuracy of a data set with respect to a vertical datum, at a specified confidence level. The vertical accuracy is computed from the vertical positional error along the Z axis. Vertical accuracy is presented as RMSEV. For point cloud data—whether it be from lidar, IFSAR, or photogrammetry—vertical accuracy is typically taken as a point-to-surface measurement from the checkpoint normal to the point cloud surface.",
  "references": [
    "Glossary of Mapping Sciences (1994)",
    "Manual of Airborne Topographic Lidar (2012)",
    "Manual of Photogrammetry, 6th Edition (2013)",
    "Digital Elevation Model Technologies and Applications: The DEM User’s Manual, 3rd Edition (2018)"
  ]
},
{
  "section": "6",
  "title": "SYMBOLS, ABBREVIATED TERMS, AND NOTATIONS",
  "symbols_abbreviated_terms_notations": {
    "ASPRS": "American Society for Photogrammetry and Remote Sensing",
    "DEM": "Digital Elevation Model",
    "DTM": "Digital Terrain Model",
    "GCP": "Ground Control Point",
    "GNSS": "Global Navigation Satellite System",
    "GPS": "Global Positioning System",
    "GSD": "Ground Sample Distance",
    "IDW": "Inverse Distance Weighing",
    "IFSAR": "Interferometric Synthetic Aperture Radar",
    "IMU": "Inertial Measurement Unit",
    "NGPS": "Nominal Ground Point Spacing",
    "NMAS": "National Map Accuracy Standards",
    "NPD": "Nominal Pulse Density",
    "NPS": "Nominal Pulse Spacing",
    "NSSDA": "National Standard for Spatial Data Accuracy",
    "NVA": "Non-Vegetated Vertical Accuracy",
    "RMS": "Root Mean Square",
    "RMS_DZ": "The RMS of differences in elevations sampled at the same point location in overlapping swaths of lidar data",
    "RMSE": "Root-Mean-Square Error",
    "RMSE_3D": "The three-dimensional RMSE that represents both horizontal and vertical errors in a point position"
  }
},


{
    "symbols_abbreviated_terms_notations": {
      "RMSE_H": "The horizontal linear RMSE in the radial direction that includes both X- and Y coordinate errors",
      "RMSE_V": "The vertical linear RMSE that represents the vertical accuracy of elevation data",
      "RMSE_X": "Linear RMSE in the X direction (Easting)",
      "RMSE_Y": "Linear RMSE in the Y direction (Northing)",
      "RMSE_Z": "Linear RMSE in the Z direction (Elevation)",
      "TIN": "Triangulated Irregular Network",
      "VVA": "Vegetated Vertical Accuracy",
      "x̄": "Sample mean error",
      "𝜎": "Sample standard deviation",
      "γ_1": "Sample skewness"
    }
  },
  {
    "section": "7",
    "title": "SPECIFIC REQUIREMENTS",
    "description": "These Standards define accuracy classes based on RMSE thresholds for digital orthoimagery, digital planimetric data, and digital elevation data. Accuracy testing is always recommended but may not be required for all data sets; specific requirements must be addressed in the project specifications.",
    "testing_requirements": {
      "horizontal_accuracy": "Shall be tested by comparing the planimetric coordinates of well-defined points in the data set with coordinates determined from an independent source of higher accuracy.",
      "vertical_accuracy": "Shall be tested by comparing the elevations of the surface represented by the data set with elevations determined from an independent source of higher accuracy. This is done by comparing the elevations of the checkpoints with elevations interpolated from the data set at the same X, Y coordinates. See Section C.11 for detailed guidance on interpolation methods.",
      "three_dimensional_accuracy": "Shall be tested by comparing the X, Y, and Z coordinates of well-defined points in the data set with X, Y, and Z coordinates determined from an independent source of higher accuracy."
    },
    "additional_notes": "All accuracies are assumed to be relative to the published datum as specified in the project specifications. Ground control accuracies and survey procedures should be established according to project requirements. Unless specified to the contrary, it is expected that all ground control points and checkpoints should follow guidelines for network accuracy as detailed in the Geospatial Positioning Accuracy Standards, Part 2: Standards for Geodetic Networks (FGDC-STD-007.2-1998), the NOAA Technical Memorandum NOS NGS 92, and Addendum II of these Standards. When local control is needed to meet specific accuracies or project needs, it must be clearly identified in both the project specifications and the metadata. When reporting accuracy, the number of significant digits in the result must be appropriate."
  },

  

{
  "note": "Reported accuracy values shall be equal to the number of significant digits in the delivered product coordinates."
},
{
  "section": "7.1",
  "title": "Statistical Assessment of Accuracy",
  "description": "Horizontal accuracy is to be expressed as RMSE_H, derived from two horizontal error components, RMSE_X and RMSE_Y (see Section 7.3). Vertical accuracy is to be expressed as RMSE_V (see Section 7.4). Three-dimensional positional accuracy is to be expressed as RMSE_3D, derived from the horizontal and vertical accuracy components, RMSE_H and RMSE_V (see Section 7.5). Furthermore, elevation data sets shall also be assessed for horizontal accuracy (RMSE_H) whenever possible (see Section 7.6). More details on the application and calculation of these statistics can be found in Appendix D – Accuracy Statistics and Examples."
},
{
  "section": "7.2",
  "title": "Systematic Error and Mean Error Assumptions",
  "description": "Except for vertical data in vegetated terrain, the assessment methods outlined in these Standards assume that the data set errors are normally distributed and that any significant systematic errors or biases have been removed.",
  "responsibility": "It is the responsibility of the data producer to test and verify that the data meets this requirement by evaluating all statistical parameters—including standard deviation, median, mean, and RMSE—as these may aid in the discovery and diagnosis of systematic errors. Evaluation of additional statistical measures, such as kurtosis and skew, are strongly advised.",
  "mean_error_notes": "Acceptable mean error may vary by project and should be negotiated between the data producer and the data user. As a rule, these Standards recommend that the mean error be less than 25% of the target RMSE specified for the project. Mean error greater than 25% of the target RMSE, whether identified pre-delivery or post-delivery, should be investigated to diagnose the cause. These findings should then be reported in the metadata. If further actions are taken to correct bias and reduce the mean error, these actions should also be reported in the metadata. If the data producer and data user agree to accept a mean error greater than 25% of the RMSE, this should be reported in the metadata as well.",
  "blunder_definition": "When RMSE testing is performed, a discrepancy between the data set and a checkpoint that exceeds 3 times the target RMSE threshold in any component of the coordinate (X, Y, or Z) shall be interpreted as a blunder. The blunder should be investigated, explained, and corrected before the data set is considered to meet these Standards. Blunders may not be discarded without proper investigation. Removal of blunders should be explained and reported in the project metadata.",
  "summary": "Systematic error or biases in data can be easily detected and eventually removed by analyzing the additional statistical terms that these Standards require data producers to generate, such as mean, median, and standard deviation. Users of these Standards are encouraged to review Appendix D for further information on these statistical terms, as well as guidance on how to utilize them when investigating the presence of systematic errors as presented in Addendum I, Section C."
},
{
  "section": "7.3",
  "title": "Horizontal Positional Accuracy Standard for Geospatial Data",
  "description": "Table 7.1 defines the primary horizontal accuracy standard for digital data, including digital orthoimagery, digital planimetric data, scaled planimetric maps, and elevation data. These Standards specify Horizontal Accuracy Classes in terms of RMSE_H, the combined linear error along a horizontal."
},

{
  "section": "7.3",
  "title": "Horizontal Positional Accuracy Standard for Geospatial Data",
  "description": "Defines how horizontal accuracy should be calculated and represented in modern geospatial standards.",
  "rmseh_formula": "RMSE_H = √(RMSE_X² + RMSE_Y²)",
  "content": [
    "RMSE_H is derived from RMSE_X and RMSE_Y according to the following formula: RMSE_H = √(RMSE_X² + RMSE_Y²).",
    "Previous ASPRS standards used discrete, numerically-ranked accuracy classes tied to map scale (e.g., Class 1, Class 2, Class 3). Many modern applications of geospatial data call for horizontal accuracies that are not tied directly to compilation scale, resolution of the source imagery, or final pixel resolution.",
    "These Standards allow more flexibility; they do not classify horizontal accuracy discretely, nor do they tie accuracy class to map scale.",
    "Horizontal accuracy needs should be determined by project requirements, and the Horizontal Accuracy Class of a dataset should be expressed as a function of RMSE_H.",
    "For example, a project could require products that meet the ASPRS Positional Accuracy Standards for a 7.5-cm Horizontal Accuracy Class, meaning that RMSE_H must be ≤ 7.5 cm.",
    "In the case of digital orthoimagery mosaics, an additional criterion for the allowable mismatch at seamlines of ≤ 2 * RMSE_H is specified in Table 7.1.",
    "The term RMSE_H should be computed using both RMSE_H1 and RMSE_H2 error components, as described in Section 7.12."
  ],
  "table_7_1": {
    "title": "Table 7.1 Horizontal Accuracy Classes for Geospatial Data",
    "columns": [
      "Horizontal Accuracy Class",
      "Absolute Accuracy RMSE_H (cm)",
      "Orthoimagery Mosaic Seamline Mismatch (cm)"
    ],
    "example_row": [
      "#-cm",
      "≤ #",
      "≤ 2 * #"
    ]
  },
  "appendix_references": [
    "Appendix B includes examples that relate accuracy classes in these Standards to legacy standards.",
    "Table B.4 provides RMSE_H recommendations for digital orthoimagery of various pixel sizes and compares modern and legacy ASPRS/NMAS standards.",
    "The recommended associations in Table B.4 are meant to guide users through the transition from legacy to modern standards, though they may evolve over time.",
    "These Standards discourage using GSD, map scale, or contour interval to express product accuracy."
  ],
  "conversion_note": "In these Standards, horizontal accuracy is expressed as RMSE_H. In the 2014 and 1990 ASPRS Standards, accuracy was expressed in terms of RMSE_X and RMSE_Y. The following formula is used for conversion: RMSE_H = √(RMSE_X² + RMSE_Y²), as outlined in Section B.5."
},

{
	"fields": {
		"section": "7.4 Vertical Positional Accuracy Standard for Elevation Data",
		"details": {
			"vertical_accuracy": {
				"expressed_as": "RMSEV",
				"applicable_to": "both vegetated and non-vegetated terrain",
				"computed_using": "RMSEV and RMSE₁₂ error components",
				"NVA_thresholds": "listed in Table 7.2",
				"VVA_criteria": "no pass/fail criteria, only needs to be tested and reported",
				"agreement_for_VVA": "data producer and data user may agree on an acceptable threshold",
				"acceptance_condition": "if NVA meets user specifications, VVA should be accepted at the reported accuracy level"
			},
			"table_7.2": {
				"vertical_accuracy_classes": {
					"absolute_accuracy": {
						"NVA": {
							"RMSEv (cm)": "#-cm",
							"Within-Swath": "≤ 0.60 * #",
							"Smooth Swath-to-Swath": "≤ 0.80 * #",
							"Non-Vegetated": "≤ 1.60 * #"
						},
						"VVA": {
							"RMSEv (cm)": "#-cm",
							"Swath-to-Swath": "As found"
						}
					},
					"data_internal_precision": {
						"Non-Vegetated": {
							"Within-Swath": "≤ 0.60 * #",
							"Smooth Swath-to-Swath": "≤ 0.80 * #",
							"Swath-to-Swath": "≤ 1.60 * #"
						}
					}
				}
			},
			"point_spacing_density": {
				"importance": "representation of terrain is also a function of point spacing/density",
				"note": "It is possible to have a very small RMSEV at checkpoints, even when the surface lacks sufficient resolution to represent terrain details present in the terrain.",
				"reference": "See Addendum I for more on this topic.",
				"recommendation": "recommended minimum point density and point spacing at typical Vertical Accuracy Classes, as listed in Table B.7"
			},
			"related_tables": {
				"Table_B.5": "Lists 10 typical examples of Vertical Accuracy Class, RMSEV, and corresponding Data Internal Precision values based on equations from Table 7.2.",
				"Table_B.6": "Relates Vertical Accuracy Class and RMSEV to legacy ASPRS and NMAS Standards.",
				"Table_B.7": "Provides recommended minimum point density and point spacing at typical Vertical Accuracy Classes."
			},
			"NVA_computation": {
				"based_on": "ground checkpoints in traditional open and urban terrain surfaces",
				"terrain_types": [
					"bare soil",
					"sand",
					"gravel",
					"short grass",
					"asphalt",
					"concrete"
				]
			},
			"VVA_computation": {
				"based_on": "ground checkpoints in all types of vegetated terrain",
				"terrain_types": [
					"tall weeds",
					"crop land",
					"brush",
					"fully forested areas"
				],
				"exemption": "from pass/fail testing criteria, only needs to be tested according to the standards",
				"reporting": "The results should then be reported in the metadata."
			}
		}
	},
	"text": "7.4 Vertical Positional Accuracy Standard for Elevation Data\nVertical accuracy is to be expressed as RMSEV in both vegetated and non - vegetated terrain . Vertical\nAccuracy Classes are defined by the associated RMSEV specified for the product . It should be understood\nthat the term RMSEv should be computed using both RMSEV , and RMSE₁₂ error components as\ndescribed in Section 7.12 . While the Non - Vegetated Vertical Accuracy ( NVA ) must meet accuracy\nthresholds listed in Table 7.2 , the Vegetated Vertical Accuracy ( VVA ) has no pass / fail criteria and needs\nonly to be tested and reported as found . If the NVA meets user specifications , VVA should be accepted\nat the reported accuracy level .\nFor projects where vegetated terrain is dominant , the data producer and the data user may agree on an\nacceptable threshold for the VVA . Table 7.2 provides the Vertical Accuracy Class specifications for digital\nelevation data , including Data Internal Precision requirements where applicable , such as in lidar\nacquisition . Horizontal accuracy for elevation data should also be explicitly specified and reported , as\ndiscussed in Section 7.6 .\nTable 7.2 Vertical Accuracy Classes for Digital Elevation Data\nAbsolute Accuracy Data Internal Precision ( where applicable )\nVertical\nWithin - Swath Smooth Swath - to - Swath Swath - to - Swath\nAccuracy NVA VVA\nClass Surface Precision Non - Vegetated Non - Vegetated\nRMSEv ( cm ) RMSEv ( cm )\nMax Diff ( cm ) RMSDz ( cm ) Max Diff ( cm )\n# -cm S # As found ≤ 0.60 * # ≤ 0.80 * # ≤ 1.60 * #\nTable B.5 lists 10 typical examples of Vertical Accuracy Class , RMSEV , and corresponding Data Internal\nPrecision values based on the equations shown in Table 7.2 above . Table B.6 relates Vertical Accuracy\nClass and RMSEV of digital elevation data to legacy ASPRS and NMAS Standards for the same examples .\nThe degree to which an elevation surface accurately represents terrain is not only represented by\nvertical agreement at ground checkpoints ; accurate representation of terrain is also a function of point\nspacing / density . It is possible to have a very small RMSE relative to checkpoints , even when the surface\nlacks sufficient resolution to represent details present in the terrain ( for more on the subject , refer to\nAddendum I of these Standards ) . Table B.7 provides recommended minimum point density and point\nspacing at typical Vertical Accuracy Classes .\nNVA should be computed based on ground checkpoints located in traditional open ( bare soil , sand ,\ngravel , and short grass ) and urban ( asphalt and concrete ) terrain surfaces . VVA is computed based on\nground checkpoints in all types of vegetated terrain , including tall weeds , crop land , brush , and fully\nforested areas . VVA is exempted from pass / fail testing criteria , and only needs to be tested according to\nthe requirements set forth in these Standards . The results should then be reported in the metadata ."
},

{
  "section": "7.4",
  "title": "Vertical Positional Accuracy Standard for Elevation Data",
  "text": [
    "Vertical accuracy is to be expressed as RMSEV in both vegetated and non-vegetated terrain.",
    "Vertical Accuracy Classes are defined by the associated RMSEV specified for the product.",
    "RMSEV should be computed using both RMSEV₁ and RMSEV₂ error components as described in Section 7.12.",
    "While the Non-Vegetated Vertical Accuracy (NVA) must meet accuracy thresholds listed in Table 7.2, the Vegetated Vertical Accuracy (VVA) has no pass/fail criteria and only needs to be tested and reported as found.",
    "If the NVA meets user specifications, VVA should be accepted at the reported accuracy level.",
    "For projects where vegetated terrain is dominant, the data producer and the data user may agree on an acceptable threshold for the VVA.",
    "Table 7.2 provides the Vertical Accuracy Class specifications for digital elevation data, including Data Internal Precision requirements where applicable (such as in lidar acquisition).",
    "Horizontal accuracy for elevation data should also be explicitly specified and reported, as discussed in Section 7.6."
  ],
  "table": {
    "title": "Table 7.2 Vertical Accuracy Classes for Digital Elevation Data",
    "columns": [
      "Vertical Accuracy Class",
      "RMSEv (cm)",
      "Within-Swath",
      "Smooth Swath-to-Swath",
      "Swath-to-Swath"
    ],
    "rows": [
      {
        "NVA": {
          "RMSEv (cm)": "#-cm",
          "Within-Swath": "≤ 0.60 * #",
          "Smooth Swath-to-Swath": "≤ 0.80 * #",
          "Swath-to-Swath": "≤ 1.60 * #"
        },
        "VVA": {
          "RMSEv (cm)": "#-cm",
          "Swath-to-Swath": "As found"
        }
      }
    ]
  },
  "additional_notes": [
    "Table B.5 lists 10 typical examples of Vertical Accuracy Class, RMSEV, and corresponding Data Internal Precision values based on the equations shown in Table 7.2.",
    "Table B.6 relates Vertical Accuracy Class and RMSEV of digital elevation data to legacy ASPRS and NMAS Standards for the same examples.",
    "The degree to which an elevation surface accurately represents terrain is not only represented by vertical agreement at ground checkpoints; accurate representation of terrain is also a function of point spacing/density.",
    "It is possible to have a very small RMSEV relative to checkpoints even when the surface lacks sufficient resolution to represent details present in the terrain.",
    "Refer to Addendum I of these Standards for more details.",
    "Table B.7 provides recommended minimum point density and point spacing at typical Vertical Accuracy Classes."
  ],
  "NVA_computation": {
    "based_on": "Ground checkpoints in traditional open and urban terrain surfaces",
    "terrain_types": [
      "Bare soil",
      "Sand",
      "Gravel",
      "Short grass",
      "Asphalt",
      "Concrete"
    ]
  },
  "VVA_computation": {
    "based_on": "Ground checkpoints in all types of vegetated terrain",
    "terrain_types": [
      "Tall weeds",
      "Crop land",
      "Brush",
      "Fully forested areas"
    ],
    "criteria": "Exempted from pass/fail testing; only needs to be tested and reported in the metadata according to the standards"
  }
},

{
  "text": [
    "accuracies, either 'produced to meet' or 'tested to meet,' should be reported for all photogrammetrically derived elevation data sets, expressed as RMSEH.",
    "Lidar elevation data: Horizontal error in lidar-derived elevation data is largely a function of the following and can be estimated based on related parameters:",
    "● Sensor positioning error as derived from the Global Navigation Satellite System (GNSS)",
    "● Attitude (angular orientation) error as derived from the IMU",
    "● Flying height above the mean terrain",
    "The following equation¹ provides an estimate for the horizontal accuracy for a lidar-derived data set (RMSEH), assuming positional accuracy of the GNSS; roll, pitch, and yaw/heading accuracy of the Inertial Measurement Unit (IMU); and the flying height are quantified:"
  ],
  "equations": [
    "RMSE_H = sqrt( (GNSS positional error)^2 + ((tan(IMU roll or pitch error) + tan(IMU heading error)) * flying height / 1.478)^2 )"
  ],
  "equation_notes": [
    "flying height above mean terrain is in meters",
    "GNSS positional errors are radial, in meters, and can be derived from manufacturer specifications",
    "IMU errors are in angular units and can be derived from manufacturer specifications"
  ],
  "notes": [
    "For most lidar systems used in mapping applications, other error sources, such as laser ranging and clock timing, are small contributors to the error budget and can be considered negligible when estimating horizontal error.",
    "It is worth mentioning here that lidar beam divergence, or the spread of the pulse footprint, was not factored in the previous equation because:",
    "1) most lidar systems used by the industry today have very narrow footprints,",
    "2) the beam divergence is sensitive to the terrain slope and the varying footprint across the field of view of the sensor, and attempting to factor it in to the calculation would add a new level of complexity to the computations."
  ],
  "additional_equation": {
    "description": "If the Horizontal Accuracy Class for the lidar data has been agreed upon by the data producer and data user, then the equation above can be rearranged to solve for the recommended flying height above mean terrain (FH):",
    "equation": "FH = 1.478 / (tan(IMU roll or pitch error) + tan(IMU heading error)) * sqrt(RMSE_H^2 - (GNSS positional error)^2)"
  },
  "references": [
    "Table B.8 expresses estimates of horizontal error (RMSEH) as a function of flying height using an example set of GNSS and IMU errors defined in Section B.8.",
    "¹This method is one approach developed by Dr. Qassim Abdullah. Other methods also exist but are not presented here."
  ]
},

{
  "section": "7.7 Low Confidence Areas in Elevation Data",
  "content": [
    "In areas of dense vegetation, it can be difficult to collect reliable elevation data. This occurs in imagery where the ground is obscured or in deep shadow, or with lidar or radar imaging where there is low signal reflectance or return.",
    "These Standards recommend that such low confidence areas be delineated by polygons and reported in the metadata. Low confidence polygons are the digital equivalent to the dashed contours referred to in legacy standards.",
    "The thoroughness of such delineation should be discussed and agreed upon by the data user and data producer according to project requirements.",
    "Section C.8 provides specific guidelines for collecting and reporting low confidence areas in elevation data."
  ]
},
{
  "section": "7.8 Vegetated Vertical Accuracy and Challenging Environment",
  "content": [
    "Based on the industry experience with the poor performance of different mapping techniques under vegetation, whether it be from lidar or photogrammetric methods, these Standards do not rely on the VVA results to determine the acceptability of collected project data.",
    "Lidar performance should only be evaluated in open terrain where there is no vegetation to disturb its performance. Terrain modeling in vegetated areas is always problematic for many reasons:",
    "1. For imagery-based mapping practices, the ground under trees is not always visible. Therefore, such areas are always tagged as “low confidence areas,” as illustrated in Section 7.7.",
    "2. Similarly, for lidar mapping practices, vegetation blocks some of the lidar pulses from reaching the ground under vegetation. Depending on the density and type of vegetation, poor modeling of the terrain is to be expected due to the compromised point cloud density.",
    "3. The survey team usually measures the elevation of the actual ground, while the lidar point cloud measures the tops of the leaves, debris, and grass overlaying the ground. The measured difference in the elevation of the terrain under vegetation undermines the assessed accuracy, thus revealing one of the weaknesses of the VVA concept. For ideal situations, it is recommended to position surveyed points on smooth surfaces underneath vegetation with the least amount of undulation or debris lying on the surface; however, this is not practical to achieve in most cases.",
    "4. Forest floor debris moves with wind, water runoff, and animals’ disturbances to the soil. In addition to the error vegetation already introduces, it also grows in height and shape over time, which can pose serious problems, especially if the survey is not performed at the same time as the airborne survey.",
    "5. For terrain modeling with lidar, the modeling quality is dependent upon the success of the ground filter algorithm used to segment and filter the point cloud. This can lead to algorithmic or even human errors, influencing the results.",
    "6. Some GNSS-based surveying techniques face challenges when conducted under dense vegetation. Unless extra precautions are taken or different surveying practices or techniques are used in tandem, the results of the GNSS-based survey for the checkpoints or ground control will be compromised. Users of these Standards are advised to consult the recommendations provided in Addendum II when surveying checkpoints or control points for VVA assessment."
  ]
}


]